wrk_rps_merged/280
Running 5m test @ http://10.108.167.50:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 314.066ms, rate sampling interval: 1242ms
  Thread calibration: mean lat.: 350.555ms, rate sampling interval: 1254ms
  Thread calibration: mean lat.: 346.178ms, rate sampling interval: 1268ms
  Thread calibration: mean lat.: 320.180ms, rate sampling interval: 1245ms
  Thread calibration: mean lat.: 358.097ms, rate sampling interval: 1251ms
  Thread calibration: mean lat.: 369.205ms, rate sampling interval: 1264ms
  Thread calibration: mean lat.: 373.412ms, rate sampling interval: 1310ms
  Thread calibration: mean lat.: 370.554ms, rate sampling interval: 1300ms
  Thread calibration: mean lat.: 369.461ms, rate sampling interval: 1307ms
  Thread calibration: mean lat.: 376.935ms, rate sampling interval: 1265ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   342.27ms  309.39ms   2.99s    81.87%
    Req/Sec     9.51      3.07    23.00     84.28%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  300.80ms
 75.000%  412.93ms
 90.000%  623.10ms
 99.000%    1.63s 
 99.900%    2.39s 
 99.990%    2.81s 
 99.999%    3.00s 
100.000%    3.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.489     0.000000            1         1.00
      35.519     0.100000         2903         1.11
     130.623     0.200000         5807         1.25
     203.903     0.300000         8705         1.43
     228.351     0.400000        11624         1.67
     300.799     0.500000        14534         2.00
     311.551     0.550000        15959         2.22
     322.047     0.600000        17425         2.50
     383.743     0.650000        18861         2.86
     398.847     0.700000        20310         3.33
     412.927     0.750000        21762         4.00
     424.447     0.775000        22485         4.44
     485.119     0.800000        23206         5.00
     498.687     0.825000        23946         5.71
     513.791     0.850000        24657         6.67
     561.151     0.875000        25380         8.00
     600.575     0.887500        25744         8.89
     623.103     0.900000        26112        10.00
     689.663     0.912500        26468        11.43
     729.087     0.925000        26833        13.33
     814.591     0.937500        27194        16.00
     840.191     0.943750        27374        17.78
     906.239     0.950000        27558        20.00
     936.447     0.956250        27742        22.86
    1120.255     0.962500        27918        26.67
    1217.535     0.968750        28102        32.00
    1290.239     0.971875        28192        35.56
    1321.983     0.975000        28280        40.00
    1394.687     0.978125        28371        45.71
    1419.263     0.981250        28462        53.33
    1502.207     0.984375        28555        64.00
    1529.855     0.985938        28598        71.11
    1596.415     0.987500        28643        80.00
    1610.751     0.989062        28688        91.43
    1646.591     0.990625        28734       106.67
    1703.935     0.992188        28779       128.00
    1718.271     0.992969        28803       142.22
    1729.535     0.993750        28824       160.00
    1799.167     0.994531        28851       182.86
    1827.839     0.995313        28871       213.33
    1906.687     0.996094        28893       256.00
    1913.855     0.996484        28904       284.44
    1922.047     0.996875        28915       320.00
    1930.239     0.997266        28929       365.71
    1938.431     0.997656        28938       426.67
    2006.015     0.998047        28950       512.00
    2096.127     0.998242        28955       568.89
    2211.839     0.998437        28960       640.00
    2301.951     0.998633        28967       731.43
    2322.431     0.998828        28972       853.33
    2420.735     0.999023        28977      1024.00
    2521.087     0.999121        28980      1137.78
    2625.535     0.999219        28983      1280.00
    2707.455     0.999316        28986      1462.86
    2709.503     0.999414        28989      1706.67
    2713.599     0.999512        28992      2048.00
    2721.791     0.999561        28993      2275.56
    2725.887     0.999609        28994      2560.00
    2729.983     0.999658        28996      2925.71
    2736.127     0.999707        28997      3413.33
    2791.423     0.999756        28999      4096.00
    2791.423     0.999780        28999      4551.11
    2793.471     0.999805        29001      5120.00
    2793.471     0.999829        29001      5851.43
    2793.471     0.999854        29001      6826.67
    2811.903     0.999878        29002      8192.00
    2811.903     0.999890        29002      9102.22
    2820.095     0.999902        29003     10240.00
    2820.095     0.999915        29003     11702.86
    2820.095     0.999927        29003     13653.33
    2822.143     0.999939        29004     16384.00
    2822.143     0.999945        29004     18204.44
    2822.143     0.999951        29004     20480.00
    2822.143     0.999957        29004     23405.71
    2822.143     0.999963        29004     27306.67
    2996.223     0.999969        29005     32768.00
    2996.223     1.000000        29005          inf
#[Mean    =      342.272, StdDeviation   =      309.386]
#[Max     =     2994.176, Total count    =        29005]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30050 requests in 5.00m, 146.83MB read
  Socket errors: connect 0, read 0, write 0, timeout 3
Requests/sec:    100.15
Transfer/sec:    501.13KB