wrk_rps_merged/281
Running 5m test @ http://10.98.41.12:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 324.901ms, rate sampling interval: 1449ms
  Thread calibration: mean lat.: 339.478ms, rate sampling interval: 1437ms
  Thread calibration: mean lat.: 348.292ms, rate sampling interval: 1473ms
  Thread calibration: mean lat.: 337.540ms, rate sampling interval: 1575ms
  Thread calibration: mean lat.: 352.620ms, rate sampling interval: 1432ms
  Thread calibration: mean lat.: 358.187ms, rate sampling interval: 1471ms
  Thread calibration: mean lat.: 356.032ms, rate sampling interval: 1435ms
  Thread calibration: mean lat.: 364.099ms, rate sampling interval: 1575ms
  Thread calibration: mean lat.: 376.546ms, rate sampling interval: 1651ms
  Thread calibration: mean lat.: 387.455ms, rate sampling interval: 1586ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.79s     4.73s   36.31s    91.33%
    Req/Sec     9.50      4.91    48.00     85.54%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  296.45ms
 75.000%  522.75ms
 90.000%    4.63s 
 99.000%   24.07s 
 99.900%   31.64s 
 99.990%   34.47s 
 99.999%   36.34s 
100.000%   36.34s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.530     0.000000            1         1.00
      15.063     0.100000         2901         1.11
      84.735     0.200000         5802         1.25
     136.063     0.300000         8707         1.43
     216.447     0.400000        11613         1.67
     296.447     0.500000        14510         2.00
     315.391     0.550000        15961         2.22
     386.559     0.600000        17408         2.50
     410.111     0.650000        18857         2.86
     488.447     0.700000        20315         3.33
     522.751     0.750000        21763         4.00
     598.527     0.775000        22497         4.44
     690.687     0.800000        23209         5.00
     816.127     0.825000        23935         5.71
    1214.463     0.850000        24660         6.67
    2504.703     0.875000        25384         8.00
    3395.583     0.887500        25747         8.89
    4632.575     0.900000        26109        10.00
    6365.183     0.912500        26472        11.43
    8937.471     0.925000        26837        13.33
   11288.575     0.937500        27197        16.00
   12525.567     0.943750        27380        17.78
   13705.215     0.950000        27562        20.00
   14843.903     0.956250        27742        22.86
   16015.359     0.962500        27930        26.67
   17055.743     0.968750        28106        32.00
   17694.719     0.971875        28195        35.56
   18120.703     0.975000        28285        40.00
   19038.207     0.978125        28377        45.71
   20135.935     0.981250        28473        53.33
   21299.199     0.984375        28557        64.00
   22069.247     0.985938        28603        71.11
   22822.911     0.987500        28651        80.00
   23658.495     0.989062        28693        91.43
   24526.847     0.990625        28739       106.67
   25509.887     0.992188        28784       128.00
   25952.255     0.992969        28807       142.22
   26542.079     0.993750        28830       160.00
   26951.679     0.994531        28852       182.86
   27721.727     0.995313        28877       213.33
   28344.319     0.996094        28898       256.00
   28639.231     0.996484        28909       284.44
   28917.759     0.996875        28920       320.00
   29425.663     0.997266        28931       365.71
   29736.959     0.997656        28944       426.67
   30343.167     0.998047        28955       512.00
   30605.311     0.998242        28961       568.89
   30703.615     0.998437        28965       640.00
   31244.287     0.998633        28971       731.43
   31539.199     0.998828        28977       853.33
   31670.271     0.999023        28982      1024.00
   32243.711     0.999121        28986      1137.78
   32342.015     0.999219        28989      1280.00
   32456.703     0.999316        28991      1462.86
   32538.623     0.999414        28995      1706.67
   32604.159     0.999512        28996      2048.00
   32751.615     0.999561        28998      2275.56
   33406.975     0.999609        28999      2560.00
   33472.511     0.999658        29001      2925.71
   33554.431     0.999707        29002      3413.33
   33685.503     0.999756        29003      4096.00
   34406.399     0.999780        29004      4551.11
   34439.167     0.999805        29005      5120.00
   34471.935     0.999829        29007      5851.43
   34471.935     0.999854        29007      6826.67
   34471.935     0.999878        29007      8192.00
   34471.935     0.999890        29007      9102.22
   34570.239     0.999902        29008     10240.00
   34570.239     0.999915        29008     11702.86
   34570.239     0.999927        29008     13653.33
   35422.207     0.999939        29009     16384.00
   35422.207     0.999945        29009     18204.44
   35422.207     0.999951        29009     20480.00
   35422.207     0.999957        29009     23405.71
   35422.207     0.999963        29009     27306.67
   36339.711     0.999969        29010     32768.00
   36339.711     1.000000        29010          inf
#[Mean    =     1792.321, StdDeviation   =     4725.718]
#[Max     =    36306.944, Total count    =        29010]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30050 requests in 5.00m, 141.40MB read
  Socket errors: connect 0, read 0, write 0, timeout 1282
  Non-2xx or 3xx responses: 2549
Requests/sec:    100.15
Transfer/sec:    482.58KB